name: "resnet152"
platform: "pytorch_libtorch"
max_batch_size: 16
dynamic_batching {
    preferred_batch_size: [1, 2, 4, 8, 16]
}

input [
    {
        name: "input__0"
        data_type: TYPE_FP32
        dims: [3, -1, -1]
    }
]
output [
    {
        name: "output__0"
        data_type: TYPE_FP32
        dims: [1000]
    }
]
instance_group [
    {
        count:1
        kind: KIND_GPU
    }
]